HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxSpu_bf.h
/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A4 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A4_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A4 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A4_OFF (4u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A5 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A5_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A5 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A5_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A5 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A5_OFF (5u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A6 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A6_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A6 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A6_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A6 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A6_OFF (6u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A7 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A7_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A7 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A7_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A7 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A7_OFF (7u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A8 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A8_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A8 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A8_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A8 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A8_OFF (8u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A9 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A9_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A9 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A9_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A9 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A9_OFF (9u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A10 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A10_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A10 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A10_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A10 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A10_OFF (10u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A11 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A11_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A11 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A11_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A11 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A11_OFF (11u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A12 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A12_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A12 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A12_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A12 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A12_OFF (12u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A13 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A13_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A13 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A13_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A13 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A13_OFF (13u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A14 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A14_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A14 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A14_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A14 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A14_OFF (14u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A15 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A15_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A15 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A15_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A15 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A15_OFF (15u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A16 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A16_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A16 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A16_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A16 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A16_OFF (16u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A17 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A17_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A17 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A17_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A17 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A17_OFF (17u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A18 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A18_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A18 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A18_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A18 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A18_OFF (18u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A19 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A19_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A19 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A19_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A19 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A19_OFF (19u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A20 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A20_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A20 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A20_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A20 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A20_OFF (20u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A21 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A21_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A21 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A21_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A21 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A21_OFF (21u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A22 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A22_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A22 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A22_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A22 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A22_OFF (22u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A23 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A23_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A23 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A23_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A23 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A23_OFF (23u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A24 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A24_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A24 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A24_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A24 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A24_OFF (24u)

/** \brief Length for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A25 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A25_LEN (1u)

/** \brief Mask for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A25 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A25_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MD_MASK_ACCEPT_Bits.B_A25 */
#define IFX_SPU_MD_MASK_ACCEPT_B_A25_OFF (25u)

